;;; git packages -*- lexical-binding: t -*-

(package! magit)
(package! magit-gitflow)
(package! git-commit)
(package! magit-popup)
(package! with-editor)
(package! gitconfig-mode)
(package! gitignore-mode)
(package! gitattributes-mode)

(package! evil-magit)
