;;; cc packages -*- lexical-binding: t -*-
;;
;; Use rtags to jump and use irony to do completion and error check. And use EBrowse to make a class graph.

(package! rtags)
(package! helm-rtags)

(package! irony)
(package! company-irony)
(package! flycheck-irony)
(package! irony-eldoc)

(package! disaster)
(package! function-args)

(package! cmake-mode)
(package! cmake-font-lock)

(package! call-graph)
