;;; evil packages -*- lexical-binding: t -*-

(package! evil)
(package! evil-goggles)
(package! evil-surround)
(package! evil-visualstar)
(package! evil-numbers)
(package! evil-snipe)
(package! evil-matchit)
(package! evil-lion)
